In [1]:
import pandas as pd
import numpy as np

In [10]:
list = ['4', '8', '15', '16', '23', '42']
f= pd.Series(list)
print(f)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [7]:
lst = np.random.randint(1,10,10)

In [8]:
lst

array([6, 5, 8, 6, 4, 2, 5, 2, 9, 8])

In [9]:
g=pd.Series(lst)

In [11]:
print(g)

0    6
1    5
2    8
3    6
4    4
5    2
6    5
7    2
8    9
9    8
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [13]:
dict = {'Name':['Alice', 'Bob', 'Claire'],
       'Age':['25','30','27'],
       'Gender':['Female','Male','Female']
       }
t = pd.DataFrame(dict)
print(t)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A Dataframe is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. In dataframe datasets arrange in rows and columns, we can store any number of datasets in a dataframe. Whereas, Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

In [16]:
lst = ['Spring', 'Winter', 'Summer', 'Monsoon']

df = pd.DataFrame(lst)
print(df)

         0
0   Spring
1   Winter
2   Summer
3  Monsoon

In [ ]:
data = [1, 2, 3, 4]
 
ser = pd.Series(data)
print(ser)

0    1
1    2
2    3
3    4
dtype: int64

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [17]:
#1. Dataframe.insert()
dict = {'Name':['Alice', 'Bob', 'Claire'],
       'Age':['25','30','27'],
       'Gender':['Female','Male','Female']
       }
t = pd.DataFrame(dict)
t.insert(2,'Email', ['alice@gmail.com', 'bob@gmail.com','claire@gmail.com'])
print(t)

     Name Age             Email  Gender
0   Alice  25   alice@gmail.com  Female
1     Bob  30     bob@gmail.com    Male
2  Claire  27  claire@gmail.com  Female

In [18]:
#2. Dataframe.assign() 
dict = {'Name':['Alice', 'Bob', 'Claire'],
       'Age':['25','30','27'],
       'Gender':['Female','Male','Female']
       }
t = pd.DataFrame(dict)
t1 = t.assign(City=['Mumbai','Bangalore','Delhi'])
print(t1)

     Name Age  Gender       City
0   Alice  25  Female     Mumbai
1     Bob  30    Male  Bangalore
2  Claire  27  Female      Delhi

In [21]:
#3. Drop()
t1

     Name Age  Gender       City
0   Alice  25  Female     Mumbai
1     Bob  30    Male  Bangalore
2  Claire  27  Female      Delhi

In [22]:
t1.drop(['City'], axis=1)

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [24]:
#4.DataFrame.truncate()
t

     Name Age  Gender
0   Alice  25  Female
1     Bob  30    Male
2  Claire  27  Female

In [25]:
t.truncate(before='1', after='1')

  Name Age Gender
1  Bob  30   Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All the three are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [ ]:
dict1 = {'January': pd.Series(['22', '58','61', '89']),
         'February':\
                 pd.Series([210, 211, 114, 178]),
         'March': pd.Series([21, 21, 24, 23])}